Revit 2027 API
ProjectLocation.Create Method
 Create an instance of ProjectLocation in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ProjectLocation Create(
	Document document,
	ElementId siteLocationId,
	string name
)
Public Shared Function Create (
	document As Document,
	siteLocationId As ElementId,
	name As String
) As ProjectLocation
public:
static ProjectLocation^ Create(
	Document^ document,
	ElementId^ siteLocationId,
	String^ name
)
static member Create :
        document : Document *
        siteLocationId : ElementId *
        name : string -> ProjectLocation
Parameters
document Document
 The document where the new instance of ProjectLocation would be created in.
siteLocationId ElementId
 The ElementId of the SiteLocation to which the new ProjectLocation would be created.
name String
 The name of the instance of ProjectLocation to be created.
Return Value
ProjectLocation
 The newly created instance of ProjectLocation.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- The element siteLocationId does not exist in the document -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- There is already a ProjectLocation with this name in the given SiteLocation.
ArgumentNullException |  A non-optional argument was null
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
 The created instace of ProjectLocation would have the specified name and an identity Transform.
See Also
Reference
ProjectLocation Class
Autodesk.Revit.DB Namespace